export const Answer = [
  {
    user_id: 1,
    project_id: 1,
    question_id: 1,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 1,
    question_id: 2,
    answer_date: new Date("2023-07-06"),
    content: "選択肢A",
  },
  {
    user_id: 1,
    project_id: 1,
    question_id: 3,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 2,
    question_id: 1,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 2,
    question_id: 2,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 2,
    question_id: 3,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 3,
    question_id: 1,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 3,
    question_id: 2,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
  {
    user_id: 1,
    project_id: 3,
    question_id: 3,
    answer_date: new Date("2023-07-06"),
    content:
      "回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。回答内容が入ります。",
  },
];

export const ModelAnswer = [
  {
    editor_id: 9999,
    project_id: 1,
    question_id: 1,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 1,
    question_id: 2,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 1,
    question_id: 3,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 2,
    question_id: 1,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 2,
    question_id: 2,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 2,
    question_id: 3,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 3,
    question_id: 1,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 3,
    question_id: 2,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
  {
    editor_id: 9999,
    project_id: 3,
    question_id: 3,
    edit_date: new Date("2023-07-07"),
    content:
      "模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。模範解答が入ります。",
  },
];

export const Comment = [
  {
    user_id: 1,
    admin_id: 9999,
    project_id: 1,
    comment_date: new Date("2023-07-07"),
    content:
      "コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。",
  },
  {
    user_id: 1,
    admin_id: 9999,
    project_id: 2,
    comment_date: new Date("2023-07-07"),
    content:
      "コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入りますコメント内容が入ります。",
  },
  {
    user_id: 1,
    admin_id: 9999,
    project_id: 3,
    comment_date: new Date("2023-07-07"),
    content:
      "コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入ります。コメント内容が入りますコメント内容が入ります。",
  },
];

export const User = [
  {
    id: 9999,
    name: "管理者太郎",
    image_url: "/icon/human_icon.png",
  },
];
